# Dependencies installed via `brew bundle`
# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k" 

#
#   Programs
#
brew "act"
brew "argocd"
brew "awscli"
brew "azure-cli"
brew "Azure/kubelogin/kubelogin"
brew "bat"          # cat replacement
brew "chart-testing"
brew "chezmoi"      # dotfile management
brew "ctop"         # top for Docker containers
brew "coreutils"
brew "diff-so-fancy"
brew "docker-compose"
brew "fd"           # find replacement
brew "fish"         # shell of choice
brew "fzf"          # fuzzy finder
brew "gh"			      # GitHub CLI
brew "ghq"          # git repo management
brew "git"
brew "gnupg"
brew "grpcurl"
brew "go"
brew "helm"
brew "hugo"
brew "jfrog-cli"
brew "just"         # An handy way to save and run project-specific commands
brew "jq"           # JSON querying/manipulation
brew "kind"
brew "krew"
brew "kubectl"      # Kubernetes CLI tool
brew "kubectx"      # Kubernetes context/namespace switching
brew "k9s"
brew "lsd"          # ls replacement
brew "minikube"
brew "mkcert"
brew "mockery"      # Go mock generator
brew "mysql"        # Needed to get nodes
brew "nvm"
brew "neovim"
brew "node"
brew "opa"
brew "openssh"
brew "openshift-cli"
brew "openldap"
brew "pinentry-mac"
brew "podman"
brew "powerlevel10k"
brew "pre-commit"
brew "python"
brew "pyenv"
brew "ripgrep"
brew "rosa-cli"
brew "saml2aws"
brew "serverless"
brew "starship"     # shell powerline
brew "staticcheck"  # static code analysis for Go
brew "terraform"    # IaC
brew "terraform-docs" 
brew "tflint"       # lint for terraform
brew "tig"          # git interface
brew "thefuck"      # that corrects errors in previous console commands.
brew "tldr"         # short documentation command
brew "trash"        # rm to trashcan
brew "trivy"
brew "yamllint"
brew "yq"           # YAML querying/manipulation
brew "watch"
brew "wget"
brew "zplug"        # A plugin manager for ZSH
brew "zsh"          # another shell of choice
brew "zsh-completions"
brew "1password-cli"


cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "powershell"
cask "textmate"
